#pragma pack(1)
#include <tpv_dat.h>
#include <fcntl.h>
#include <stdio.h>
#include <stdlib.h>
#include <global.h>
#include <archivos.h>
#include <boletin.h>
#include <btrv.h>
#include <b_mens.h>
#include <carga.h>
#include <clientes.h>
#include <cmemory.h>
#include <cr.h>
#include <cr_disco.h>
#include <dbrouter.h>
#include <get_fech.h>
#include <get_hora.h>
#include <lista.h>
#include <log.h>
#include <mensaje.h>
#include <mstring.h>
#include <pant.h>
#include <print.h>
#include <promo.h>
#include <retiros.h>
#include <scanner.h>
#include <script.h>
#include <socios.h>
#include <tkt.h>
#include <t_pago.h>
#include <uti-comp.h>
#include <zip.h>
#include <_cr0.h>
#include <_cr1.h>
#include <dd.h>
#include <import_t.h>
#include <deftables.h>
#include <db.h>
#include <cio.h>
#include <tcp_ip.h>
#include <cmemory.h>
#include <cadafech.h>
#include <ini.h>
/* ------------------------------------------------------------------------------
 * Sistema: TPV 1000 - IV
 * ------------------------------------------------------------------------------
 */
#include <string.h>
#include <aarch.h>
#undef MK_FP
#ifdef INVEL_L
#include <sys/io.h>
#include <sys/stat.h>
#include <sys/time.h>
#else
#include <dos.h>
#include <sys/stat.h>
#endif
#include <actions.h>
#include <zip.h>
#include <path.h>
#include <myodbc.h>
#include <typeacti.h>

#define TAMANO_BUFFER_RTA 3072

struct _script
{
	BINARY status;			//0
	INT16 nro_caja;			//1
	unsigned long id;		//3
	INT16 cod_comando;      //7
	INT16 cod_estado;		//9
	char param[56];			//11
	UINT16 fecha_comando;   //67
	UINT16 hora_comando;    //69
	UINT16 fecha_estado;    //71
	UINT16 hora_estado;     //73
    BINARY cod_funcion;     //75
	BINARY reintentos;      //76
	BINARY fin;		//77
};
#define CANT_COL_SCRIPT     12

struct _respuesta_script {
 //El campo STATUS se usa para marcar que la respuesta fue enviada por el Jsincro.
 //Son los mismos codigos de estado que en eventos (0 pendiente, 1 enviado, 2 en uso). 
 BINARY status;			//0 
 INT16 nro_caja;		//1
 unsigned long id;      //3
 INT16 cod_comando;     //7
 char param[56];		//9
 INT16 cod_rta;			//65
 char reenviado;		//67
 INT16 fecha;			//68
 INT16 hora;			//70
 //char reserva[25];
 //char buffer[TAMANO_BUFFER_RTA];
 char buffer[3072];      //72
 BINARY fin;
};

/* COMANDOS DEL SCRIPT
 * ---------------------------------------------------------------------
 * case  1: *--- Copiar Archivos
 * case  2: *--- Agregar Altas
 * case  3: *--- Agregar Modificaciones
 * case  4: *--- Rebootear PC
 * case  5: *--- Borrar Memoria
 * case  6: *--- Copiar Listas
 * case  7: *--- Ejecutar programa
 * case  8: *--- Padron completo de Articulos
 * case  9: *--- Habilitar PC
 * case 10: *--- Retiros Remotos
 * case 11: *--- Emitir z_remoto
 * case 12: *--- Pide estructura de la rnv
 * case 20: *--- Insertar Tabla en DBRouter
 * case 21: *--- Obtener Archivo cabecera y pie de ticket desde DBR
 * case 22: *--- Obtener Archivo de configuracion config.dat desde dbr
 * case 23: *--- De Testeo - Devuelve siempre Error
 * case 24: *--- Obtener Tabla de DBRouter  TABLA ARCHIVO WHERE
 * case 25: *--- PUT archivo FTP al Server
 * case 26: *--- GET archivo FTP a la caja
 * case 27: *--- Novedades de Clientes
