/* ------------------------------------------------------------------------------
 * Sistema: TPV 1000 - IV
 * ------------------------------------------------------------------------------
 */
#pragma pack(1)
#include <cr.h>
#include <tpv_dat.h>
#include <config.h>
#include <stdlib.h>
#include <fcntl.h>
#include <sys/stat.h>
#include <lista.h>
#include <recupero.h>
#include <ini.h>
#ifdef INVEL_L
#include <sys/types.h>	
#include <unistd.h>
#include <sys/io.h>
#define _lseek lseek
#else
#include <io.h>
#endif
#include <math.h>
#include <memory.h>
#include <string.h>
#include <btrv.h>
#include <aarch.h>
#include <_val.h>
#include <panel.h>
#include <pagos.h>
#include <deftables.h>
#include <db.h>
#include <cmemory.h>
#include <cadafech.h>
#include <inc_mes.h>
#include <_cr1.h>
#include <mensaje.h>
#include <trim.h>
#include <m_cadena.h>
#include <pant.h>
#include <pg_fecha.h>
#include <tarjetas.h>
#include <pago_tar.h>
#include <dtoa.h>
#include <b_mens.h>
#include <clave.h>
#include <netcom2.h>
#include <tar_mag.h>
#include <cambio_m.h>
#include <func.h>
#include <comtar.h>
#include <fecha.h>
//#include <INC_DIA.h>
#include <inc_year.h>
#include <malloc.h>
#include <ftoc.h>
#include <round.h>
#include <get_fech.h>
#include <alarma.h>
#include <cr_pant.h>
#include <day.h>
#include <mon.h>
#include <year.h>
#include <cio.h>
#include <log.h>
#include <path.h>
#include <motor.h>
#if defined(INVEL_W) || defined(INVEL_L)
#include <actions.h>
#include <typeacti.h>
#endif
//Almacena el cod_tarjeta seleccionado por el usuario (modo servicios)
int cod_tar_selected;
struct _tarjetas *tarjetas_sic;
/*struct _cuo_tar 
{
 BINARY status;							//0
 unsigned short cod_tarjeta;			//1
 char nro_cuota;						//3
 char hab_cuota_pesos;					//4
 float rec_cuota_pesos;					//5
 char hab_cuota_fin_tar_pesos;			//9
 float rec_cuota_fin_tar_pesos;			//10
 char nro_orden;						//14
 char descripcion[21];					//15
 float entrega;							//36
 char hab_cuota_dol;					//40
 float rec_cuota_dol;					//41
 char hab_cuota_fin_tar_dol;			//45
 float rec_cuota_fin_tar_dol;			//46
 char tabla[6];							//50
 float coeficiente;						//56
 char hab_afinidad;						//60
 char pide_entrega;						//61
 char vigencia;							//62
 char controlar_total_cuotas;			//63
 char credito;							//64
 char hab_diferimiento;					//65
 float tasa;							//66
 short cod_grupo;						//70
 char unicamente_online;				//72
 char exclusivo_promocion;				//73
 char reserva[6];						//74
};*/
struct _cajas 
{
	BINARY status;				//0
	short nro_caja;				//1
	char habilitada_cuotas;     //3
    INT16 seccion;
	char serial[12];
	BINARY fin;		
};
struct _ind_cuo_tar
{
    unsigned short cod_tarjeta;
    char nro_orden;
};
struct _ind_cuo_tar_gru
{
    unsigned short cod_tarjeta;
    short cod_grupo;
    char nro_orden;
};

struct _vigencias 
{
	BINARY status;					//0
	unsigned short cod_tarjeta;     //1
	BINARY nro_orden;				//3
	char nombre[21];				//4
	BINARY cod_vigencia;			//25
	BINARY fin;				//26
};
struct _ind_vigencia
{
    unsigned short cod_tarjeta;
    BINARY nro_orden;
};
struct _ind3_vigencia
{
    unsigned short cod_tarjeta;
    char cod_vigencia;
};
struct _ter_caja 
{
 BINARY status;				//0
 unsigned short caja;		//1
 BINARY nodo;				//3
 long terminal;				//4
 BINARY fin;			//8
};

struct _diferir_tarjeta {
	BINARY status;						//0
	unsigned short cod_tarjeta;		//1
	unsigned short nro_diferimiento;   //3
	char descripcion[21];				//5
	BINARY fin;
};

struct
{
    unsigned short cod_tarjeta;
    unsigned short nro_diferimiento;
} indice_diferimiento;

struct _habil_difer_tarj {
	BINARY status;      //0
	INT16 cod_tarjeta;      //1
	INT16 dia_difer_inicio;      //3
	INT16 dia_difer_fin;      //5
	INT16 dia_difer_presenta;      //7
	INT16 cant_difer_meses;      //9
	BINARY fin;     //11
};

struct
{
    unsigned short cod_tarjeta;
    unsigned short difer_presenta;
    unsigned short difer_meses;
} indice_habil_diferimiento;
struct _ind_cuo_gru
{
    unsigned short cod_tarjeta;
    short cod_grupo;
};

#ifdef COMPILA_DATOS_TARJETAS_PRIVADOS
static struct _datos_privados_tarjeta {
	char numero_tarjeta_privado[30];
	unsigned  fecha_vto_privada;
	char cod_servicio_privado[4];
	char pin_privado[21];
	char track_1_privado[80];       //348
	char track_2_privado[38];
}VAR_TARJ_PRIV;

	
#endif

void REEMPLAZO_BANDERA_BINARIA(int numero_entero,char* cadena,int posicion, char picture);
long NRO_TERMINAL( int marca );
double _PIDE_ENTREGA( char *titulo, int enteros, int decimales, int signo );
int CONFIRMAR_NUMERO_TARJETA( int marca );
int TARJ_PIDE_TELEFONO( char * );
int TARJ_PIDE_TELEFONO( char * );
static char cambio_de_tarjeta = 0;
static struct _cuo_tar cuo_tar;
static struct _cuo_gru *cuo_gru;
static struct _ind_cuo_tar ind_cuo_tar;
static struct _ind_cuo_tar_gru ind_cuo_tar_gru;
static struct _ind_cuo_gru ind_cuo_gru;
static struct _vigencias vigencia;
static struct _ind_vigencia ind_vigencia;
static struct _diferir_tarjeta dif_tar;
static struct _habil_difer_tarj habdifta;
//extern char      buf_track1[81], buf_track2[51];
// Definiciones transitorias
#define _ARGENCARD          0
#define _MASTERCARD         1
#define _CARTA_FRANCA       2
#define _CREDENCIAL_VIEJA   3
